Repository: thep/lanxang
Catalog: po/*.po
Languages: th

source: Tham input sequence check mode
th: รูปแบบการตรวจสอบลำดับอักขระอักษรธรรม

source: Strictness of Tham input sequence checking. 'Passthrough' does not check anything. 'Basic' checks input just to ensure proper text rendering. 'Strict' is more picky on Tham orthography correctness.
th: ความเข้มงวดของการตรวจสอบลำดับอักขระอักษรธรรม: 'Passthrough' จะไม่ตรวจสอบใดๆ 'Basic' ตรวจสอบลำดับเพียงเพื่อให้สามารถจัดแสดงข้อความได้อย่างเหมาะสมเท่านั้น 'Strict' จะเข้มงวดมากขึ้นเรื่องความถูกต้องของอักขรวิธีอักษรธรรม

source: Thai Noi input sequence check mode
th: รูปแบบการตรวจสอบลำดับอักขระอักษรไทยน้อย

source: Strictness of Thai Noi input sequence checking. 'Passthrough' does not check anything. 'Basic' checks input just to ensure proper text rendering. 'Strict' is more picky on Thai Noi orthography correctness.
th: ความเข้มงวดของการตรวจสอบลำดับอักขระอักษรไทยน้อย: 'Passthrough' จะไม่ตรวจสอบใดๆ 'Basic' ตรวจสอบลำดับเพียงเพื่อให้สามารถจัดแสดงข้อความได้อย่างเหมาะสมเท่านั้น 'Strict' จะเข้มงวดมากขึ้นเรื่องความถูกต้องของอักขรวิธีอักษรไทยน้อย

source: Lao Pali input sequence check mode
th: รูปแบบการตรวจสอบลำดับอักขระภาษาบาลีอักษรลาว

source: Strictness of Lao Pali input sequence checking. 'Passthrough' does not check anything. 'Basic' checks input just to ensure proper text rendering. 'Strict' is more picky on Lao Pali orthography correctness.
th: ความเข้มงวดของการตรวจสอบลำดับอักขระภาษาบาลีอักษรลาว: 'Passthrough' จะไม่ตรวจสอบใดๆ 'Basic' ตรวจสอบลำดับเพียงเพื่อให้สามารถจัดแสดงข้อความได้อย่างเหมาะสมเท่านั้น 'Strict' จะเข้มงวดมากขึ้นเรื่องความถูกต้องของอักขรวิธีภาษาบาลีอักษรลาว

source: IBus LanXang Tham Preferences
th: ปรับแต่ง IBus LanXang สำหรับอักษรธรรม

source: _Cancel
th: _ยกเลิก

source: _OK
th: _ตกลง

source: Input sequence check mode:
th: รูปแบบการตรวจสอบลำดับอักขระ:

source: _No Check
th: ไ_ม่ตรวจ

source: Let all key sequences pass through.
th: อนุญาตให้พิมพ์ได้ทุกลำดับ

source: _Basic Check
th: _พื้นฐาน

source: Check using basic rules, allowing more spelling exceptions.
th: ตรวจสอบลำดับโดยใช้กฎพื้นฐาน ซึ่งจะยอมรับวิธีสะกดแบบพิเศษต่างๆ

source: _Strict Check
th: เ_ข้มงวด

source: Check using more strict orthographical rules, disallowing many exeptions.
th: ตรวจสอบลำดับโดยใช้กฎอักขรวิธีที่เข้มงวดขึ้น ซึ่งจะไม่ยอมรับวิธีสะกดแบบพิเศษหลายกรณี
